{
  "key": "qvhpcx0s",
  "title": "Goldie Locks",
  "author": "Grimm Bros.",
  "tagLine": "Too hot!",
  "description": "An innocent girl loses her way.",
  "firstChapter": {
    "id": 1,
    "teaser": "When a little girls gets lost in the woods, she discovers a true test of character.",
    "heading": "A Stroll Through the Woods",
    "prose": "There once was a girl named Goldie Locks.  She was named so because of her curly, golden hair that bounced with her lithe little step.<p>As she was taking her morning stroll, Goldie Locks noticed a new path.  What should she do?</p>",
    "nextChapterOptions": [
      {
        "id": 2,
        "teaser": "Take the strange new path and see where it goes.",
        "heading": "Into the Woods",
        "prose": "Goldie Locks feels adventurous and without a moments hesitation bounds along the new path.  Before long, she comes across a lovely little cottage tucked neatly into a small clearing of trees.  It looks like such a lovely little place that she decides she wants to see inside. What does she do?",
        "nextChapterOptions": [
          {
            "id": 4,
            "teaser": "Ring the doorbell.",
            "heading": "How Very Polite",
            "prose": "Goldie Locks rings the doorbell and waits.  She rings the doorbell again and begins to lose patience.",
            "nextChapterOptions": [
              {
                "id": 7,
                "teaser": "We need the ability to loop",
                "heading": "We need the ability to loop",
                "prose": "At this point in the story, it would be nice to offer the other two options of going right in or going home.  Instead, for now, we will call this the end."
              }
            ]
          },
          {
            "id": 5,
            "teaser": "Go right in.",
            "heading": "Things Get Interesting",
            "prose": "From here on out, we know the story of Goldie Locks, and there is no need to repeat it here.  This ought to be enough to understand that the \"winning\" path is for Goldie Locks to be chased away by the three bears who were so rudely disturbed from their quiet life in the forest."
          },
          {
            "id": 6,
            "teaser": "On second thought, perhaps she ought to be getting back home.",
            "heading": "Time To Go Home",
            "prose": "Goldie Locks decides that she has had enough of this, turns around and heads back the way she came.  After retracing her steps, she recovers the path she knows well and finishes her stroll through the woods.  The End."
          }
        ]
      },
      {
        "id": 3,
        "teaser": "Stay on the path she knows.",
        "heading": "Goldie Goes Home",
        "prose": "Not feeling particularly adventurous that day, Goldie Locks decides to stay on the path as usual, and as usual, the day was rather ordinary."
      }
    ]
  }
}