{"summary":{"key":"rgn7ujai","title":"The Cave of Wonders","author":"Aladdin","tagLine":"Do you seek the treasure?","about":"Enter a world of wonder, the Cave of Wonders, and be amazed!","firstChapter":{"targetChapterId":1,"teaser":"Tell me more..."}},"chapters":[{"id":1,"heading":"The Desert","prose":"You are wandering through an endless desert looking for the undiscoverable.  \"Only by magic,\" you were told, \"would you find what you seek.  And only the chosen one will find the magic.  Perhaps it is you who are chosen.\"  With newfound humility and a touch of despare, you wonder how you got yourself into this mess.","nextChapterOptions":[{"targetChapterId":2,"teaser":"Go in"},{"targetChapterId":3,"teaser":"Stay out"},{"targetChapterId":6,"teaser":"Build a campfire"},{"targetChapterId":7,"teaser":"Look for higher ground"},{"targetChapterId":10,"teaser":"Take out the amulet you were given."}]},{"id":2,"heading":"Where Are YOU?","prose":"You see a light.  It's beautiful.","nextChapterOptions":[{"targetChapterId":4,"teaser":"Go left"},{"targetChapterId":5,"teaser":"Go right"}]},{"id":3,"heading":"Life Goes On","prose":"Well, I guess you are not much for adventure.","nextChapterOptions":[]},{"id":4,"heading":"You Win!","prose":"You discover the long lost booty of the dread pirate Stevens.  You are set for the rest of your long and enjoyable life.","nextChapterOptions":[]},{"id":5,"heading":"You Die!","prose":"You take the passageway to the right, which goes ends in a drop-off.  Unfortunately, the cave is so dark at this point that you do not see where the floor disappears, and you fall to an untimely death.","nextChapterOptions":[]},{"id":7,"heading":"Hello","prose":"World","nextChapterOptions":[{"targetChapterId":8,"teaser":"look around"},{"targetChapterId":9,"teaser":"duck!"}]},{"id":8,"heading":null,"prose":null,"nextChapterOptions":[]},{"id":9,"heading":"Duck!","prose":"Something comes flying out of nowhere.  You barely escape because you listened to your spidey sense.","nextChapterOptions":[]},{"id":10,"heading":"The Amulet","prose":"One of the many reasons that allowed you to convince yourself to embark on this God-forsaken journey was the \"magical\" amulet sold to you by the talkative merchant.  He said, \"In your moment of deepest despair, gaze upon the amulet, and therein you will see what eludes you.\"  Although you feel silly, this might be just the time to steal a glance.","nextChapterOptions":[{"targetChapterId":11,"teaser":"Look into the amulet."},{"targetChapterId":12,"teaser":"Things could be worse -- keep walking and save yourself the embarrassment."}]},{"id":11,"heading":"What You See","prose":"When you look into the amulet, you realize that you are looking through it.  What you see makes you blink.  There is a door of sandstone superimposed on the sand beyond.  You lower the amulet and look to the same place, but the door is not there.  Is this some trick?\n\nSadly, you never find out.","nextChapterOptions":[]},{"id":12,"heading":null,"prose":null,"nextChapterOptions":[]}]}